KnowledgeModuleEJB/test/templates/template_KMR_workbench_REQUEST.xml


<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
   <SOAP-ENV:Body>
      <kmr:KmRecordRequest xmlns:kmr="urn:gov:hhs:fha:nhinc:kmr:kmtypes">
         <kmr:request>
            <kmr:requestReference>
               <kmr:requestId>String</kmr:requestId>
               <kmr:requestDate>String</kmr:requestDate>
               <kmr:responseDate>String</kmr:responseDate>
            </kmr:requestReference>
            <kmr:km>
               <kmr:createdByAuthorID>String</kmr:createdByAuthorID>
               <kmr:createdByAuthorName>String</kmr:createdByAuthorName>
               <kmr:createdTimestamp>String</kmr:createdTimestamp>
               <kmr:isCheckedOut>true</kmr:isCheckedOut>
               <kmr:kmDescription>String</kmr:kmDescription>
               <kmr:kmId>0</kmr:kmId>
               <kmr:kmKeywords>String</kmr:kmKeywords>
               <kmr:kmName>String</kmr:kmName>
               <kmr:kmOrganizationLevel>String</kmr:kmOrganizationLevel>
               <kmr:kmType>String</kmr:kmType>
               <kmr:lastModifiedByAuthorID>String</kmr:lastModifiedByAuthorID>
               <kmr:lastModifiedByAuthorName>String</kmr:lastModifiedByAuthorName>
               <kmr:lastModifiedTimestamp>String</kmr:lastModifiedTimestamp>
               <kmr:latestVersionNum>0</kmr:latestVersionNum>
               <kmr:originInstitution>String</kmr:originInstitution>
               <kmr:parentKMId>0</kmr:parentKMId>
               <kmr:productionVersionNum>0</kmr:productionVersionNum>
               <kmr:validationStatus>String</kmr:validationStatus>
               <kmr:Specialty>
                  <TerminologyScheme>String</TerminologyScheme>
                  <TerminologyCode>String</TerminologyCode>
               </kmr:Specialty>
               <kmr:Fact>
                  <Type>String</Type>
                  <TerminologyScheme>String</TerminologyScheme>
                  <TerminologyCode>String</TerminologyCode>
               </kmr:Fact>
               <kmr:PopulationDependency>
                  <PD_Status>String</PD_Status>
                  <PD_Scope>String</PD_Scope>
                  <PD_Name>String</PD_Name>
                  <TerminologyScheme>String</TerminologyScheme>
                  <TerminologyCode>String</TerminologyCode>
                  <TerminologyValue>String</TerminologyValue>
               </kmr:PopulationDependency>
               <kmr:Inference>
                  <TerminologyScheme>String</TerminologyScheme>
                  <TerminologyCode>String</TerminologyCode>
               </kmr:Inference>
               <kmr:Task>
                  <TD_Type>String</TD_Type>
                  <TerminologyScheme>String</TerminologyScheme>
                  <TerminologyCode>String</TerminologyCode>
               </kmr:Task>
               <kmr:ACL>
                  <User_OrganizationLevel>String</User_OrganizationLevel>
                  <UR_Name>String</UR_Name>
                  <AuthorId>String</AuthorId>
               </kmr:ACL>
            </kmr:km>
         </kmr:request>
      </kmr:KmRecordRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
