KnowledgeModuleEJB/test/samples/KMR_exp_SearchByKmIds_REQUEST.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/" xmlns:SOAP-ENC="http://schemas.xmlsoap.org/soap/encoding/" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema">
   <SOAP-ENV:Body>
      <m:KmIdSearchRequest xmlns:m="urn:gov:hhs:fha:nhinc:kmr:kmtypes">
         <m:request>
            <m:requestReference>
               <m:requestId>97</m:requestId>
               <m:requestDate>2010-03-22T00:03:22.000-00:07</m:requestDate>
            </m:requestReference>
            <m:ACL>
               <UR_Name>Providers-Physicians</UR_Name>
               <!--UR_Name>Internal Domain Expert</UR_Name-->
            </m:ACL>
            <m:kms>
               <m:kmId>1</m:kmId>
               <m:kmId>2</m:kmId>
               <m:kmId>3</m:kmId>
            </m:kms>
         </m:request>
      </m:KmIdSearchRequest>
   </SOAP-ENV:Body>
</SOAP-ENV:Envelope>